In [1]:
import mysql.connector

In [2]:
from mysql.connector import Error

In [3]:
import pandas as pd

In [4]:
def create_server_connection(host_name,user_name,user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password)
        print('MySQL Database connection successful')
    except Error :
        print(f'Error: "{Error}"')
    return connection

#put mysql terminal sql password

pw = "PASSWORD"

db = "companydatabase"

connection = create_server_connection("localhost","root",pw)

MySQL Database connection successful

In [5]:
def create_database(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
        
    except Error :
        print(f"Error: '{Error}'")
create_database_query = "Create database companydatabase"
create_database(connection,create_database_query)

Error: '<class 'mysql.connector.errors.Error'>'

In [6]:
def create_db_connection(host_name, user_name, user_password,db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print("MySQL database connection successful")
    except Error:
        print(f"Error : '{Error}'")
    return connection

In [7]:
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("query was successful")
    except Error:
        print(f"Error: '{Error}'")

In [8]:
def read_query(connection,query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error:
        print(f"Error: '{Error}'")

In [10]:
create_employee_table = '''
CREATE TABLE employee (
  emp_id INT PRIMARY KEY,
  first_name VARCHAR(40),
  last_name VARCHAR(40),
  birth_day DATE,
  sex VARCHAR(1),
  salary INT,
  emp_phone_no VARCHAR(40),
  super_id INT,
  branch_id INT
);
'''

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_employee_table)

MySQL database connection successful
Error: '<class 'mysql.connector.errors.Error'>'

In [9]:
create_branch_table = '''
CREATE TABLE branch (
  branch_id INT PRIMARY KEY,
  branch_name VARCHAR(40),
  mgr_id INT,
  mgr_start_date DATE,
  FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL
);

'''

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_branch_table)

MySQL database connection successful
query was successful

In [10]:
alter_emp_table = '''
ALTER TABLE employee
ADD FOREIGN KEY(branch_id)
REFERENCES branch(branch_id)
ON DELETE SET NULL;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,alter_emp_table)

MySQL database connection successful
query was successful

In [11]:
alter_emp_table = '''
ALTER TABLE employee
ADD FOREIGN KEY(super_id)
REFERENCES employee(emp_id)
ON DELETE SET NULL;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,alter_emp_table)

MySQL database connection successful
query was successful

In [12]:
create_client_table= '''
CREATE TABLE client (
  client_id INT PRIMARY KEY,
  client_name VARCHAR(40),
  branch_id INT,
  client_phone_no VARCHAR(40),
  FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL
);

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_client_table)

MySQL database connection successful
query was successful

In [14]:
create_emp_client_table = '''
CREATE TABLE emp_client (
  emp_id INT,
  client_id INT,
  total_sales INT,
  PRIMARY KEY(emp_id, client_id),
  FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE,
  FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE
);

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_emp_client_table)

MySQL database connection successful
query was successful

In [16]:
create_branch_supplier_table = '''
CREATE TABLE branch_supplier (
  branch_id INT,
  supplier_name VARCHAR(40),
  supply_type VARCHAR(40),
  PRIMARY KEY(branch_id, supplier_name),
  FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE
);

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,create_branch_supplier_table)

MySQL database connection successful
query was successful

In [17]:
insert_emp_table = '''
INSERT INTO employee
VALUES(
1001,'Naman', 'Gupta', '1980-11-30', 'M', 220000, '7255429288', NULL, NULL);
'''

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [18]:
insert_emp_table = '''
INSERT INTO employee VALUES
(1002, 'Ashish', 'Goenka', '1992-10-15', 'M', 150000, '8962521123', NULL, NULL);

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [19]:
insert_emp_table = '''
INSERT INTO branch VALUES
(501, 'Financial', 1001, '2000-05-01');
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [20]:
update_emp_table = '''
UPDATE employee 
SET branch_id = 501
WHERE emp_id = 1001;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [21]:
update_emp_table = '''
UPDATE employee 
SET branch_id = 501
WHERE emp_id = 1002;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [22]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1003,'Shruti', 'Saxena', '1978-08-13', 'F', 160000, '9123434353', NULL,NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [23]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1004, 'Monica', 'Biswas', '1985-09-12', 'F', 230000, '6216167200', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [24]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1005, 'Madan', 'Verma', '1990-06-01', 'M', 145000, '8005090811', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [25]:
insert_branch_table = '''
INSERT INTO BRANCH VALUES 
(502, 'Sales', NULL, '2002-06-12');
'''

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_branch_table)

MySQL database connection successful
query was successful

In [26]:
update_emp_table = '''
UPDATE employee
SET branch_id = 502
WHERE emp_id = 1003;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [27]:
update_emp_table = '''
UPDATE employee
SET branch_id = 502
WHERE emp_id = 1004;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [28]:
update_emp_table = '''
UPDATE employee
SET branch_id = 502
WHERE emp_id = 1005;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [29]:
update_branch_table = '''
UPDATE branch
SET mgr_id = 1004
WHERE branch_id = 502;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_branch_table)

MySQL database connection successful
query was successful

In [30]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1006, 'Neha', 'Jaiswal', '1987-07-12', 'F', 180000, '9206704288', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [31]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1007, 'Ayush', 'Tripathi', '1985-11-22', 'M', 150000, '9142526291', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [32]:
insert_branch_table = '''
INSERT INTO branch VALUES
(503, 'Human Resource', 1006, '2001-07-13');
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_branch_table)

MySQL database connection successful
query was successful

In [33]:
update_emp_table = '''
UPDATE employee
SET branch_id = 503
WHERE emp_id = 1006;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [34]:
update_emp_table = '''
UPDATE employee
SET branch_id = 503
WHERE emp_id = 1007;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [35]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1008, 'Ishaan', 'Gupta', '1999-10-12', 'M', 230000, '7846728192', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [36]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1009, 'Rashmi', 'Rajput', '2000-01-30', 'F', 140000, '7516128292', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [37]:
insert_branch_table = '''
INSERT INTO branch VALUES 
(504,'Marketing', 1008, '2010-01-11');

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_branch_table)

MySQL database connection successful
query was successful

In [38]:
update_emp_table = '''
UPDATE employee
SET branch_id = 504
WHERE emp_id = 1008;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [39]:
update_emp_table = '''
UPDATE employee
SET branch_id = 504
WHERE emp_id = 1009;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [40]:
insert_emp_table = '''
INSERT INTO employee VALUES 
(1010, 'Vinay', 'Goyal', '1984-05-02', 'M', 125000, '7891221692', NULL, NULL);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_table)

MySQL database connection successful
query was successful

In [41]:
insert_branch_table ='''
INSERT INTO branch VALUES 
(505, 'IT', 1010, '2000-06-12');

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_branch_table)

MySQL database connection successful
query was successful

In [42]:
update_emp_table = '''
UPDATE employee
SET branch_id = 505
WHERE emp_id = 1010;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [43]:
update_emp_table = '''
UPDATE employee
SET super_id = 1004
WHERE emp_id = 1001;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [44]:
update_emp_table = '''
UPDATE employee
SET super_id = 1006
WHERE emp_id = 1002;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [45]:
update_emp_table = '''
UPDATE employee
SET super_id = 1004
WHERE emp_id = 1003;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [46]:
update_emp_table = '''
UPDATE employee
SET super_id = 1008
WHERE emp_id = 1004;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [47]:
update_emp_table = '''
UPDATE employee
SET super_id = 1008
WHERE emp_id = 1005;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [48]:
update_emp_table = '''
UPDATE employee
SET super_id = 1001
WHERE emp_id = 1006;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [49]:
update_emp_table = '''
UPDATE employee
SET super_id = 1004
WHERE emp_id = 1007;
''' 

connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [50]:
update_emp_table = '''
UPDATE employee
SET super_id = 1006
WHERE emp_id = 1008;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [51]:
update_emp_table = '''
UPDATE employee
SET super_id = 1006
WHERE emp_id = 1009;

'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [52]:
update_emp_table = '''
UPDATE employee
SET super_id = 1001
WHERE emp_id = 1010;
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,update_emp_table)

MySQL database connection successful
query was successful

In [53]:
insert_client_table = '''
INSERT INTO client VALUES
(601, 'Abhinac Shukla', 502, '7112223300'),
(602, 'Raghav Singhania', 502, '8123469200'),
(603, 'Smriti Verma', 503, '9120461292'),
(604, 'Alok Yadav', 504, '9126126276'),
(605, 'Subham Singh', 503, '6162170280'),
(606, 'Rahul Gupta', 502, '7896543210'),
(607, 'Mansi Singh', 504, '8846107259'),
(608, 'Rakshika Rana', 504, '9120409020');  
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_client_table)

MySQL database connection successful
query was successful

In [54]:
insert_emp_client_table = '''
INSERT INTO emp_client VALUES
(1003, 601, 50000),
(1004, 601, 100000),
(1005, 602, 80000),
(1006, 603, 60000),
(1007, 603, 75000),
(1008, 604, 68000),
(1009, 604, 43000),
(1006, 605, 40000),
(1003, 606, 57000),
(1005, 606, 62000),
(1008, 607, 70000),
(1008, 608, 76000),
(1009, 608, 80000);
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_emp_client_table)

MySQL database connection successful
query was successful

In [55]:
insert_branch_supplier_table = '''
INSERT INTO branch_supplier VALUES
(501, 'Surya Papers', 'Paper'),
(501, 'Malti Electronics', 'Gadgets'),
(502, 'Royal Papers', 'Paper'),
(502, 'JT Forms and Labels', 'Custom Forms'),
(503, 'Royal Papers', 'Paper'),
(504, 'Surya Papers', 'Paper'),
(504, 'JT Forms and Labels', 'Custom Forms'),
(505, 'Malti Electronics', 'Gadgets'),
(505, 'Ashish Electronics', 'Gadgets');
'''
connection = create_db_connection("localhost","root",pw,db)
execute_query(connection,insert_branch_supplier_table)

MySQL database connection successful
query was successful

In [11]:
show_emp_table = '''
select *
from employee;
'''
connection = create_db_connection("localhost","root",pw,db)
results = read_query(connection,show_emp_table)
for result in results:
    print(result)

MySQL database connection successful
(1001, 'Naman', 'Gupta', datetime.date(1980, 11, 30), 'M', 220000, '7255429288', 1004, 501)
(1002, 'Ashish', 'Goenka', datetime.date(1992, 10, 15), 'M', 150000, '8962521123', 1006, 501)
(1003, 'Shruti', 'Saxena', datetime.date(1978, 8, 13), 'F', 160000, '9123434353', 1004, 502)
(1004, 'Monica', 'Biswas', datetime.date(1985, 9, 12), 'F', 230000, '6216167200', 1008, 502)
(1005, 'Madan', 'Verma', datetime.date(1990, 6, 1), 'M', 145000, '8005090811', 1008, 502)
(1006, 'Neha', 'Jaiswal', datetime.date(1987, 7, 12), 'F', 180000, '9206704288', 1001, 503)
(1007, 'Ayush', 'Tripathi', datetime.date(1985, 11, 22), 'M', 150000, '9142526291', 1004, 503)
(1008, 'Ishaan', 'Gupta', datetime.date(1999, 10, 12), 'M', 230000, '7846728192', 1006, 504)
(1009, 'Rashmi', 'Rajput', datetime.date(2000, 1, 30), 'F', 140000, '7516128292', 1006, 504)
(1010, 'Vinay', 'Goyal', datetime.date(1984, 5, 2), 'M', 125000, '7891221692', 1001, 505)

In [12]:
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ['emp_id', 'first_name', 'last_name', 'birth_day', 'sex', 'salary', 'emp_phone_no', 'super_id','branch_id']

df = pd.DataFrame(from_db, columns = columns)

display(df)

,emp_id,first_name,last_name,birth_day,sex,salary,emp_phone_no,super_id,branch_id
0,1001,Naman,Gupta,1980-11-30,M,220000,7255429288,1004,501
1,1002,Ashish,Goenka,1992-10-15,M,150000,8962521123,1006,501
2,1003,Shruti,Saxena,1978-08-13,F,160000,9123434353,1004,502
3,1004,Monica,Biswas,1985-09-12,F,230000,6216167200,1008,502
4,1005,Madan,Verma,1990-06-01,M,145000,8005090811,1008,502
5,1006,Neha,Jaiswal,1987-07-12,F,180000,9206704288,1001,503
6,1007,Ayush,Tripathi,1985-11-22,M,150000,9142526291,1004,503
7,1008,Ishaan,Gupta,1999-10-12,M,230000,7846728192,1006,504
8,1009,Rashmi,Rajput,2000-01-30,F,140000,7516128292,1006,504
9,1010,Vinay,Goyal,1984-05-02,M,125000,7891221692,1001,505